---
kind: method
id: M:Autodesk.Revit.DB.ViewSetIterator.MoveNext
source: html/48a8cf26-a686-9641-2cc8-91d0e49c3b2e.htm
---
# Autodesk.Revit.DB.ViewSetIterator.MoveNext Method

Move the iterator one item forward.

## Syntax (C#)
```csharp
public virtual bool MoveNext()
```

## Returns
Returns True if the iterator was successfully moved forward one item and the Current
 property will return a valid item. False will be returned it the iterator has reached the end of
 the set.

## Remarks
MoveNext must be called before the Current property is valid with a new or Reset iterator
 in line with the expected behavior of IEnumerator.